[
    {
        "question_number": 1,
        "question_text": "When an unexpected opportunity appears, what sparks your excitement?",
        "options": [
            {
                "option_text": "The idea of organising a memorable group event that brings people together.",
                "points": {
                    "volunteer": 3,
                    "gamer": 1
                }
            },
            {
                "option_text": "The chance to test personal limits with a burst of energy and fresh outdoor challenges.",
                "points": {
                    "runner": 3,
                    "farmer": 1
                }
            }
        ]
    },
    {
        "question_number": 2,
        "question_text": "When you encounter a complex problem, your instinct is to:",
        "options": [
            {
                "option_text": "Break it down strategically, analyse patterns, and find the most efficient solution.",
                "points": {
                    "artist": 3,
                    "gamer": 1
                }
            },
            {
                "option_text": "Roll up your sleeves and experiment with different hands-on approaches until something works.",
                "points": {
                    "crafter": 3,
                    "artist": 1
                }
            }
        ]
    },
    {
        "question_number": 3,
        "question_text": "What kind of legacy would you like to leave behind?",
        "options": [
            {
                "option_text": "A thriving natural space you helped cultivate, promoting health and tranquility for future generations.",
                "points": {
                    "farmer": 3,
                    "runner": 1
                }
            },
            {
                "option_text": "A groundbreaking piece of art or a unique handcrafted item that inspires awe and bold creativity.",
                "points": {
                    "artist": 3,
                    "crafter": 1
                }
            }
        ]
    },
    {
        "question_number": 4,
        "question_text": "When planning something special, you prioritise:",
        "options": [
            {
                "option_text": "Making sure everyone feels included and that the experience brings people closer together.",
                "points": {
                    "volunteer": 3,
                    "crafter": 1
                }
            },
            {
                "option_text": "Creating an engaging challenge or activity that gets people thinking and participating actively.",
                "points": {
                    "gamer": 2,
                    "farmer": 1
                }
            }
        ]
    },
    {
        "question_number": 5,
        "question_text": "If you were to start a new club, what would its focus be?",
        "options": [
            {
                "option_text": "A workshop for creating unique, handcrafted art pieces from unconventional or adventurous materials.",
                "points": {
                    "crafter": 3,
                    "artist": 1
                }
            },
            {
                "option_text": "A group dedicated to exploring local nature trails and identifying plants, perhaps with a mapping or strategic challenge.",
                "points": {
                    "farmer": 3,
                    "gamer": 1
                }
            }
        ]
    },
    {
        "question_number": 6,
        "question_text": "What kind of weekend plans would you prefer?",
        "options": [
            {
                "option_text": "A lively getaway with friends focused on team-based strategy games and fun social challenges.",
                "points": {
                    "gamer": 3,
                    "volunteer": 1
                }
            },
            {
                "option_text": "A relaxing retreat focused on healthy cooking workshops and learning a new hands-on craft.",
                "points": {
                    "runner": 3,
                    "crafter": 1
                }
            }
        ]
    },
    {
        "question_number": 7,
        "question_text": "When you have free time, you're drawn to:",
        "options": [
            {
                "option_text": "Activities that get your heart pumping and make you feel energized and alive.",
                "points": {
                    "runner": 3,
                    "farmer": 1
                }
            },
            {
                "option_text": "Projects where you can experiment with new techniques and express your unique vision.",
                "points": {
                    "artist": 3,
                    "crafter": 1
                }
            }
        ]
    },
    {
        "question_number": 8,
        "question_text": "What motivates you to take on a challenge?",
        "options": [
            {
                "option_text": "The chance to bring people together and make a positive impact on your community.",
                "points": {
                    "volunteer": 3,
                    "farmer": 1
                }
            },
            {
                "option_text": "The thrill of pushing creative boundaries and discovering new ways to express yourself.",
                "points": {
                    "artist": 2,
                    "runner": 2
                }
            }
        ]
    },
    {
        "question_number": 9,
        "question_text": "What kind of community improvement project would you lead?",
        "options": [
            {
                "option_text": "Setting up a regular community game night or a local esports tournament for all ages.",
                "points": {
                    "volunteer": 2,
                    "gamer": 2
                }
            },
            {
                "option_text": "Building a community garden or creating handcrafted benches and nature-inspired planters for public spaces.",
                "points": {
                    "crafter": 3,
                    "farmer": 1
                }
            }
        ]
    },
    {
        "question_number": 10,
        "question_text": "If someone gave you a surprise gift for fun, which would excite you most?",
        "options": [
            {
                "option_text": "Something that challenges my mind or lets me get close to nature.",
                "points": {
                    "gamer": 3,
                    "farmer": 1
                }
            },
            {
                "option_text": "Tickets to a lively community fair or a voucher for a relaxing spa day.",
                "points": {
                    "volunteer": 2,
                    "runner": 2
                }
            }
        ]
    }
]